/*************************************************************************
	> File Name: EP06-1.c
	> Author:zhengyang 
	> Mail:1021606521@qq.com 
	> Created Time: 2019年05月19日 星期日 19时34分24秒
 ************************************************************************/

#include<stdio.h>

//实现推到任意次方的求和公

int main() {
    int sum1 = 0, sum2 = 0;
    sum1 = 5050; //等差数列求和公式
    sum2 = (2* (100 * 100 * 100) + 3 *(100 * 100) + 100)/6
   /* for (int i = 1; i <=100 ;i++ ) {
        sum1 += i;
        sun2 += i*i;
    }*/
printf("%d\n", sum1 * sum1 -sum2);



    return 0;
}
